soap/miniupnp/miniupnpd-2.1-igd2/seeds/16_WANIPC-AddPortMapping_1

<?xml version="1.0" encoding="UTF-8"?><s:Envelope s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" ><s:Body><u:AddPortMapping xmlns:u="urn:schemas-upnp-org:service:WANIPConnection:2"><NewRemoteHost>Jn3'lLHTam{_t$]q</NewRemoteHost><NewExternalPort>31551</NewExternalPort><NewProtocol>TCP</NewProtocol><NewInternalPort>34171</NewInternalPort><NewInternalClient>!B303Y?,wPD?CdKd</NewInternalClient><NewEnabled>1</NewEnabled><NewPortMappingDescription>R?e\S`vX0Y,`oB=i</NewPortMappingDescription><NewLeaseDuration>523987</NewLeaseDuration></u:AddPortMapping></s:Body></s:Envelope>
